#include "stm32f10x.h"                  // Device header


 char str[9];

void  OLED_ShowBinary8(uint8_t data, char str[9])//行，列，字符串
	//16进制数转8位显示
{
         // 数组存字符数据，9位是因为字符数组的特殊性质要以\0结尾
    uint8_t i;        // 循环变量

    for(i = 0; i < 8; i++)
    {
        /*
            i = 0 时，检查第7位
            i = 1 时，检查第6位
            ...
            i = 7 时，检查第0位

			遍历分别把每一位提取出来
        */

        if(data & (1 << (7 - i)))//把1向左移动（7-i）位，原本：0000 0001
			//位运算，data是灰度传感器的8路数字量状态
        {
            str[i] = '1';   // 当前这一位是1，就在数组里存字符'1'
        }
        else
        {
            str[i] = '0';   // 当前这一位是0，就在数组里存字符'0'
        }
    }

    str[8] = '\0';          // 字符串结束标志，必须有

}








